{
  "posts": [
    {
      "id": 1,
      "title": "10 Trending Nail Art Designs for 2025",
      "slug": "trending-nail-designs-2025",
      "author": "Nail Art Expert",
      "date": "2025-12-20",
      "category": "Trends",
      "image": "/images/trending-nails-2025.jpg",
      "excerpt": "Discover the hottest nail art trends that are taking over in 2025. From minimalist designs to bold statement nails.",
      "content": "This comprehensive guide explores the top 10 nail art designs that are trending in 2025. From geometric patterns to gradient effects, learn how to create stunning looks that will impress everyone.",
      "tags": ["trends", "2025", "nail-design", "inspiration"]
    },
    {
      "id": 2,
      "title": "Beginner's Guide to Gel Nails",
      "slug": "beginners-guide-gel-nails",
      "author": "Beauty Blogger",
      "date": "2025-12-15",
      "category": "Tutorial",
      "image": "/images/gel-nails-guide.jpg",
      "excerpt": "Learn everything you need to know about gel nails, including application, curing, and maintenance tips.",
      "content": "Gel nails are a popular choice for long-lasting manicures. This guide covers the basics of gel nail application, proper curing techniques, and how to maintain your gel manicure for up to 3 weeks.",
      "tags": ["gel-nails", "tutorial", "beginner", "manicure"]
    },
    {
      "id": 3,
      "title": "DIY Acrylic Nail Art at Home",
      "slug": "diy-acrylic-nails-home",
      "author": "DIY Enthusiast",
      "date": "2025-12-10",
      "category": "DIY",
      "image": "/images/acrylic-diy-home.jpg",
      "excerpt": "Master the art of creating beautiful acrylic nails in the comfort of your own home with our step-by-step guide.",
      "content": "Creating acrylic nails at home doesn't have to be intimidating. Follow our detailed instructions to learn how to apply acrylic powder, shape your nails, and create stunning designs.",
      "tags": ["acrylic", "diy", "home-manicure", "nails"]
    },
    {
      "id": 4,
      "title": "Seasonal Nail Art Ideas",
      "slug": "seasonal-nail-art-ideas",
      "author": "Creative Designer",
      "date": "2025-12-05",
      "category": "Design",
      "image": "/images/seasonal-nails.jpg",
      "excerpt": "Celebrate each season with these beautiful and creative nail art designs that capture the essence of spring, summer, fall, and winter.",
      "content": "Seasonal nail art is a fun way to express yourself throughout the year. Discover designs inspired by winter snow, spring flowers, summer sunshine, and autumn colors.",
      "tags": ["seasonal", "design", "inspiration", "colors"]
    },
    {
      "id": 5,
      "title": "Essential Tools and Products for Nail Art",
      "slug": "essential-nail-art-tools",
      "author": "Product Reviewer",
      "date": "2025-11-28",
      "category": "Products",
      "image": "/images/nail-art-tools.jpg",
      "excerpt": "A comprehensive review of the must-have tools and products for creating professional-quality nail art designs.",
      "content": "Having the right tools makes all the difference in nail art. Learn about essential brushes, polishes, stamping plates, and other supplies that every nail artist should have.",
      "tags": ["tools", "products", "supplies", "professional"]
    }
  ]
}
